# YOLOv8 nano model configuration
nc: 2  # Number of classes (update based on your dataset)
depth_multiple: 0.33  # Scale factor for layers
width_multiple: 0.25  # Scale factor for channels

backbone:
  [[-1, 1, Conv, [64, 3, 2]],  # [from, number, module, args]
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C2f, [1024, True]],
   [-1, 1, SPPF, [1024, 5]]]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [512]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [256]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C2f, [512]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C2f, [1024]],

   [[17, 20, 23], 1, Detect, [nc]]]
